class PolicyData {
  static const String privacyPolicy = '''
[개인정보 처리방침]

제1조 (개인정보의 수집 및 이용 목적)
ImHere는 카카오 OAuth 연동을 통한 회원 식별 및 서비스 제공을 목적으로 최소한의 개인정보를 수집합니다.

제2조 (수집하는 개인정보 항목)
수집항목: 식별값(ID), 이메일, 프로필 이름 등

제3조 (개인정보의 보유 및 이용기간)
원칙적으로 개인정보 수집 및 이용 목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 관계 법령에 의해 보존할 필요가 있는 경우 법령에서 정한 기간 동안 보존합니다.

- 서비스 및 개인정보 관리 책임자
서비스 제공자는 개인정보 처리에 관한 업무를 총괄해서 책임짐과 동시에, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 노력하고 있습니다.

- 성명: 고동수
- 연락처: 010-7351-2781
- 이메일: kod66170@gmail.com
''';

  static const String termsOfService = '''
[서비스 이용약관]

제1조 (목적)
본 약관은 ImHere 서비스(이하 '서비스')의 이용과 관련하여 회사와 회원 간의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.

제2조 (이용계약의 체결)
이용계약은 회원이 되고자 하는 자가 본 약관에 동의하고 가입을 신청한 후 회사가 이를 승낙함으로써 체결됩니다.

제3조 (서비스의 제공 및 변경)
회사는 회원에게 안정적인 서비스를 제공하기 위해 노력하며, 운영상 또는 기술상의 필요에 따라 제공하고 있는 서비스의 전부 또는 일부를 변경할 수 있습니다.

[위치정보 이용약관]

제1조 (위치정보의 처리 원칙 및 서버 미전송)
1. ImHere 서비스는 사용자의 편의를 위해 스마트폰 등 단말기 내의 위치정보 기능을 활용할 수 있습니다.
2. 당사는 어떠한 경우에도 사용자의 위치정보를 중앙 서버로 전송하거나, 수집, 저장, 가공하지 않습니다. 모든 위치 기반 연산은 사용자의 단말기(Client) 내부에서만 독립적으로 처리됩니다.

제2조 (회원의 권리)
회원은 언제든지 단말기 설정을 통해 위치정보 기능 활성화를 거부하거나 중단할 수 있으며, 당사는 서버에 위치 데이터를 보관하지 않으므로 별도의 서버 데이터 파기 절차가 요구되지 않습니다.

''';
}
